{
  "articles" : [
    {
     "author": " Eric Levenson",

    "title":"Laura is now a hurricane and is forecast to strengthen more before hitting the Gulf Coast",

    "text":"After battering western Cuba as a tropical storm, Laura has strengthened into a hurricane in the Gulf Coast and is expected to grow even stronger as it heads toward Texas and Louisiana.\n\nHurricane Laura currently has maximum sustained winds of 75 mph, according to data from a NOAA hurricane hunter plane, and is likely to rapidly intensify into a major Category 3 storm or higher over the next day or so. The center of the storm is located 560 miles from Galveston, Texas, and it's moving at a rapid clip of 16 mph.\nA hurricane warning has been issued for portions of the Texas and Louisiana coastline, according to the National Hurricane Center. The warning, an upgrade from the earlier hurricane watch, stretches from San Luis Pass, Texas, through Intracoastal City, Louisiana.\nThe warning includes Galveston and Galveston Bay, as well as portions of the Houston metro area.\nThe NHC warned that Laura is expected to produce 4 to 8 inches of rain from Wednesday night into Saturday, with isolated maximum amounts of 12 inches across parts of the Gulf Coast. This could cause widespread flash and urban flooding, the NHC said.\nLaura's impending arrival comes as the Gulf Coast avoided a powerful storm in Marco, which significantly weakened before reaching the US.\nAs a Tropical Storm, Laura killed at least nine people in the Caribbean. When it makes landfall in the US, it could bring storm surge of 7 to 11 feet along portions of the coast, the NHC said.\n\nEvacuations in coastal Texas and Louisiana\nHouston, the largest city in the region, is particularly vulnerable to flooding and could see some impacts from Laura. The concrete-filled city has notoriously poor drainage systems and a propensity to flood, such as during the overwhelming rainfall from Hurricane Harvey in 2017.\nLaura's potential path and rapid intensification bears closer resemblance to Hurricane Rita in September 2005, the last time a major hurricane made landfall in Louisiana. Rita came just a month after Hurricane Katrina devastated the region, and its impending approach caused mass evacuations and gridlock on Texas highways.\nMore than 100 people died in Texas due to the evacuations, including 24 nursing home evacuees aboard a bus that caught fire and exploded.\nKen Allen fills sandbags Monday as he prepares for the arrival of storms Marco and Laura in Morgan City, Louisiana.\nKen Allen fills sandbags Monday as he prepares for the arrival of storms Marco and Laura in Morgan City, Louisiana.\nThe threat from Hurricane Laura has already sparked evacuations in parts of Texas and Louisiana.\nGalveston issued a mandatory evacuation order for all residents on Tuesday morning, citing the storm's strength and uncertain path, according to a post on the city website.\nA mandatory evacuation order was issued for all residents of Jefferson County, Texas, Monday, according to the county's Office of Emergency Management's Facebook page. And Orange County, Texas, has recommended a voluntary evacuation for the entire county.\nA mandatory evacuation was also announced for Calcasieu Parish in southwest Louisiana, and non-essential personnel are being ordered to leave the parish.\nAt the same time, government agencies and volunteer organizations moved to prepare for the incoming storm.\nTexas pre-deployed two Urban Search and Rescue teams (USAR) and at least eight water rescue squads, according to a spokesperson for one of the teams.\n\"The uncertainties of this storm and its increasing strength have prompted mandatory evacuations for more than 300,000 residents in East Texas and along the Gulf Coast,\" Merribeth Kahlich, a public information officer with one of the search teams, told CNN via email.\nThe American Red cross pre-positioned 700 workers and relief supplies ahead of Hurricane Laura's landfall, the group said.\nWorkers board up windows in the French Quarter in anticipation of storms Marco and Laura.\nWorkers board up windows in the French Quarter in anticipation of storms Marco and Laura.\nMarco downgraded to tropical depression\nWith Marco no longer posing an impending threat, Louisiana Gov. John Bel Edwards said Monday night all eyes are now on Laura. His big concern was large amounts of rainfall and river flooding.\n\"There will be storm surge impact, there will be wind impact, there will be rain impact,\" the governor said.\nThe Gulf was predicted to be in danger of back-to-back powerful storms with Laura striking within miles and 48 hours after Marco.\nEdwards worried earlier in the week that \"there may not be much of a window\" to enact power restoration and rescue efforts between storms.\nBut Marco made landfall near the mouth of the Mississippi River Monday as a tropical storm, and later that night was downgraded once more to a tropical depression.\nOvernight, Marco was traveling west along the Louisiana shoreline, but it will likely fizzle out over open waters as it heads toward Texas, said CNN meteorologist Michael Guy.\nThe tornadoes and storm surge that Marco threatened to bring along with it as it moved along the Gulf Coast are no longer a source of concern, Guy said. However, the storm could still be a rainmaker, and localized areas could see up to five inches of precipitation."


    },
     {
     "author": "Eliott C. McLaughlin",

    "title":"Kenosha becomes center of nationwide protests after police shoot Black man in front of his children",

    "text":"Police responded with force overnight as demonstrators torched cars and set buildings ablaze in Kenosha, Wisconsin, demanding justice in the shooting of Jacob Blake.\n\nFollow live updates\nProtesters disobeyed an 8 p.m. (9 p.m. ET) Monday curfew, facing off with law enforcement outside the Kenosha County Courthouse, some tossing water bottles and setting off fireworks, according to CNN affiliate WISN. Two city trucks were among the vehicles burned.\nLaw enforcement responded with flash bangs, tear gas and rubber bullets, the station reported.\nJacob Blake poses with his sons, according to his attorney.\nJacob Blake poses with his sons, according to his attorney.\nPolice shot Blake, a 29-year-old Black man, at close range Sunday evening as he tried to enter an SUV. In the vehicle were his 3-, 5- and 8-year-old sons, family attorney Ben Crump said.\nFollowing the shooting, the injured man was flown to a hospital in Milwaukee. He remained in intensive care late Monday, Crump said. He is suffering from paralysis from the waist down, his father, Jacob Sr., told CNN, but he wasn't sure if the condition is permanent.\n\"Thank God he's alive,\" Jacob Blake's uncle, Justin Blake, told CNN. \"We're just praying for a great recovery, that he may have a great quality of life and that his father, my brother, can enjoy him.\"\nOnly police reform will stop protests, Crump says\nEnraged protesters poured onto the streets Sunday evening after video of the shooting circulated on social media. In it, two officers trail a step or two behind Jacob Blake as he walks around a gray SUV. As he reaches the driver door and opens it, the nearest officer grabs the tail of Blake's tank top, and seven shots are heard, followed by a sustained sound of a car horn as Blake collapses into the car.\nLouisiana officials are investigating the police shooting of a 31-year-old Black man\nLouisiana officials are investigating the police shooting of a 31-year-old Black man\nTwo Kenosha officers are on administrative leave. The local police union has urged the public to withhold judgment until a state investigation is complete.\nThe shooting came as demonstrators continue to decry police violence in American cities, including the encounters that killed George Floyd and Breonna Taylor. The night before Blake's shooting, protests erupted in Lafayette, Louisiana, after police killed a Black man -- Trayford Pellerin, 31 -- outside a convenience store.\n\"If we don't have the systematic reform that this moment in America is crying out for, then we are going to continue to see hashtag after hashtag, protest after protest, and cities burning all across America,\" Crump said.\nSeveral businesses were burning late Monday in Kenosha, and Gov. Tony Evers called in the National Guard to help \"protect critical infrastructure, such as utilities and fire stations and to ensure Kenoshians are able to assemble safely,\" he said.\n\n\nVideo shows police shooting of black man in Wisconsin 01:39\nIn the Wisconsin capital, about a two-drive from Kenosha, police arrested six people, including one armed with a handgun, after some marchers began breaking windows, setting fires, looting and throwing rocks and bottles at officers, Madison police said.\nProtesters also marched in New York City, Washington, DC and Minneapolis, where at least five people were arrested.\n\"We will continue showing up until they're tired of killing us,\" a Manhattan protester told CNN affiliate WLNY.\nInvestigation into police conduct begins\nKenosha County District Attorney Michael Graveley's office is investigating the shooting, as is the Wisconsin Justice Department's division of criminal investigation. The agency plans to present a report to Graveley's office within 30 days, it said.\n\"We're asked to make two determinations,\" Graveley said. \"One, did any office in this case commit any crimes, and two, are there any crimes that we believe were committed that we can prove beyond a reasonable doubt?\"\nPolice stand near a garbage truck ablaze during protests Monday in Kenosha.\nPolice stand near a garbage truck ablaze during protests Monday in Kenosha.\nIf the answer is yes to both questions, Graveley will file charges, he said.\nGraveley also hopes federal prosecutors will conduct a parallel civil rights investigation into Blake's shooting and \"prosecute any alleged police misconduct,\" he said.\nThat investigation will \"allow this community to heal sooner because independent prosecuting agencies will be able to make determinations at the same time,\" Graveley said.\nAttorney: Blake was breaking up fight\nJust after 5 p.m. Sunday, officers responded to a domestic disturbance call in the city of 100,000 located on the Lake Michigan shoreline between Chicago and Milwaukee,\nMan who recorded Jacob Blake&#39;s shooting says he&#39;s traumatized and cannot sleep\nMan who recorded Jacob Blake's shooting says he's traumatized and cannot sleep\nIt's unclear who called 911 or what happened before the video of the shooting begins. In a police call, a dispatcher says Blake \"isn't supposed to be there,\" and that he took a complainant's keys and refused to leave. The dispatcher later explains she doesn't have more details because the caller was \"uncooperative.\"\nCrump, who represents many families whose loved ones were shot by police, including Floyd's, said Blake was leaving the scene after \"breaking up a fight between two women.\"\nRaysean White, who filmed the video that's been viewed millions of times, said two women were arguing when Blake arrived and ordered one of his sons into a vehicle. Blake then walked into a home behind a woman, White said.\nWhite, who was across the street, stepped away and when he returned saw police wrestling with Blake before one of the officers deployed his Taser on Blake, he said. He doesn't know what started the argument and began filming what he called the middle and end of the altercation.\n\"Jacob kind of leaned on the car and they proceeded to wrestle him toward the back of the car, and he went to the other side of the car,\" White told CNN. \"When they were on the other side of the car on the ground, I had to pick up my camera and start recording.\"\nPolice stand near a building that was on fire during protests Monday in Kenosha\nPolice stand near a building that was on fire during protests Monday in Kenosha\nThe dispatcher's report of shots fired came about five minutes after the initial report. According to Crump, police had already used a Taser on Blake before the shooting. It's unclear from the video if both officers opened fire. The second officer has his gun out as the shots are heard, the video clip shows.\n\"As always, the video currently circulating does not capture all the intricacies of a highly dynamic incident. We ask that you withhold from passing judgment until all the facts are known and released,\" said Pete Deates, president of the Kenosha Professional Police Association."


    },
     {
     "author": "",

    "title":"",

    "text":""


    }
  ]
}